LOOP5 *    Loop variables for Assignment 5
       05  CHAR-POS          PIC 99          VALUE 01.
       05  CLEAN-POS         PIC 99          VALUE 01.
       05  CURRENT-CHAR      PIC X.
       05  PREVIOUS-CHAR     PIC X.
