LOOP6 *    Loop variables for Assignment 6 READ-LOOP
       05  MAX-CUSTOMERS    PIC 9(4)    VALUE 1000.
       05  CUSTOMER-COUNT   PIC 9(4)    VALUE 0.
       05  FINAL-COUNT      PIC Z(4).
       05  LOOP-INDEX       PIC 9(4)    VALUE 0.
