ACCT  *    Copybook for defining bank account fields
       10  CUSTOMER-ID        PIC X(10).
       10  ACCOUNT-ID         PIC X(10).
       10  ACCOUNT-TYPE       PIC X(20).
       10  BALANCE            PIC Z(6)9V99.
       10  CURRENCY-CODE      PIC X(3).
