BANK  *    Bank info
       10  BANK-CODE        PIC X(4).
       10  BANK-NAME        PIC X(30).
       10  BANK-ADDRESS     PIC X(50).
       10  BANK-PHONE       PIC X(15).
       10  BANK-EMAIL       PIC X(30).
