       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT-2.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01  CUSTOMER-RECORD.
           05  CUSTOMER-ID       PIC X(10)       VALUE SPACES.
           05  FIRST-NAME        PIC U(20)       VALUE SPACES.
           05  LAST-NAME         PIC U(20)       VALUE SPACES.
           05  ACCOUNT-NUMBER    PIC X(20)       VALUE SPACES.
           05  ACCOUNT-BALANCE   PIC 9(7)V99     VALUE ZEROES.
           05  CURRENCY-CODE     PIC X(3)        VALUE SPACES.

       77  ACCOUNT-BALANCE-EDITED            PIC Z(7).99.

       PROCEDURE DIVISION.
      *    Assign values to the variables
       POPULATE-CUSTOMER-RECORD.
           MOVE "1235467890" TO CUSTOMER-ID.
           MOVE "Hans" TO FIRST-NAME.
           MOVE "Jørgensen" TO LAST-NAME.
           MOVE "DABADKKK991234567890" TO ACCOUNT-NUMBER.
           MOVE 500000.01 TO ACCOUNT-BALANCE.
           MOVE "DKK" TO CURRENCY-CODE.

           MOVE ACCOUNT-BALANCE TO ACCOUNT-BALANCE-EDITED.

       DISPLAY-CUSTOMER-RECORD.
           DISPLAY CUSTOMER-ID
           DISPLAY FUNCTION TRIM(FIRST-NAME) " "FUNCTION TRIM(LAST-NAME)
           DISPLAY ACCOUNT-NUMBER
           DISPLAY FUNCTION TRIM(ACCOUNT-BALANCE-EDITED) " "
           CURRENCY-CODE
           STOP RUN.
